app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM `posts`

  def show
    @post = Post.find(params[:id])
    respond_to do |format|
      if(params.has_key?(:map))
        @posts = find_posts_at(@post.locations, @post.trip)

        @photos = @posts.select {|post|  post.photo}
---
SELECT * FROM `posts` WHERE (photo_id IS NOT NULL and ((start > '2009-10-17 14:52:53' and start < '2009-10-18 14:52:53') or title = 'My Post'))
SELECT * FROM `locations` WHERE (post_id IS NOT NULL and lat > 39.9517 and lat < 39.9519 and lng > -75.2075 and lng < -75.2073)
SELECT * FROM `photos` WHERE (`photos`.`id` = 90)
SELECT * FROM `posts` WHERE (`posts`.`trip_id` = 111 AND `posts`.`id` IN (173,174,175)) ORDER BY start ASC, finish ASC

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`finish`, `updated_at`, `title`, `start`, `content`, `remote_ref`, `photo_id`, `place_string`, `trip_id`, `remote_source_id`, `created_at`) VALUES(NULL, '2009-10-19 23:27:58', 'My Test Post!', '2009-10-17 23:27:58', 'Lorem ipsum sic amet....', NULL, NULL, NULL, 1, NULL, '2009-10-19 23:27:58')

  def update
    @post = Post.find(params[:id])
    post_params = params[:post]

    # Calendar based forms pass the datetimes as strings
    if(post_params.has_key?(:start) and post_params[:start].kind_of?(String))
      post_params[:start] = DateTime.parse(post_params[:start])
    end
    if(post_params.has_key?(:finish) and post_params[:finish].kind_of?(String))
      post_params[:finish] = DateTime.parse(post_params[:finish])
    end

    if(params.has_key?(:mode))
      if(params[:mode] == 'set')
        post_params.delete(:closest_post_id)
      else
        nearest_post = Post.find(params[:post].delete(:closest_post_id))

        post_params.delete(:place_string)
        @post.place_string = nearest_post.place_string
        diff = nearest_post.point_time - @post.start
        @post.start = nearest_post.point_time
        @post.title = nearest_post.title

        post_params.delete_if {|key, val| key.index("start")}
        if(params.has_key?(:autoupdate) and params[:autoupdate] == "1")
          @post.album.each do |post|
            post.place_string = nil
            post.start = post.start + diff
            post.title = post.closest_post.title
            post.save!
---
SELECT * FROM `posts` WHERE (`posts`.trip_id = 1)
UPDATE `posts` SET `place_string` = 'Buenos Aires, Argentina', `start` = '2009-10-17 23:44:08', `title` = 'My Test Post!', `trip_id` = 1, `updated_at` = '2009-10-19 23:44:08' WHERE `id` = 8

  def upload_photo
    with_required_params(:post) do
      if(params.has_key?(:mass_upload))
        filename = params.keys.select {|key| !key.scan(/jpg|jpeg|gif|png/i).empty? }.first
        image = params[filename]
        taken = parse_exif_string(params[:exif])
      else
        image = params[:post][:image_file]
        taken = datetime_taken(image)
      end

      taken ||= params[:start]
      taken ||= DateTime.now

      photo = Photo.new
      photo.image_file = image
      respond_to do |format|
        if(photo.save)
          @post = Post.new(:title => params[:post][:title], :trip_id => params[:post][:trip_id])
          @post.photo = photo
          @post.start = taken

          if(@post.save)
---
INSERT INTO `photos` (`image_height`, `updated_at`, `image_filename`, `image_width`, `created_at`) VALUES(110, '2009-10-19 23:28:14', 'test_image.jpg', 100, '2009-10-19 23:28:14')
INSERT INTO `posts` (`finish`, `updated_at`, `title`, `start`, `content`, `remote_ref`, `photo_id`, `place_string`, `trip_id`, `remote_source_id`, `created_at`) VALUES(NULL, '2009-10-19 23:28:14', 'My Photo', '2008-04-11 16:20:11', NULL, NULL, 1, NULL, 1, NULL, '2009-10-19 23:28:14')
INSERT INTO `trips` (`updated_at`, `bottom_left_location_id`, `title`, `post_id`, `description`, `top_right_location_id`, `user_id`, `created_at`) VALUES('2009-10-20 14:52:53', NULL, 'My Trip', NULL, 'It was super cool, I went to a bunch of places and stuff', NULL, 1, '2009-10-20 14:52:53')

  def find_posts_at(locations, trip)
    # TODO: Make this suck less... maybe by  HABTM with locations?
    locs = []
    locations.each do |post_loc|
      locs += Location.find(:all, :conditions => ['post_id IS NOT NULL and lat > ? and lat < ? and lng > ? and lng < ?', post_loc.lat-0.0001, post_loc.lat+0.0001, post_loc.lng-0.0001, post_loc.lng+0.0001])
    end
    post_map = {}
    locs.each do |loc|
      post_map[loc.post_id] ||= []
      post_map[loc.post_id] << loc
    end
    post_map.delete_if { |post_id, loc_array| loc_array.length != locations.length}

    posts = Post.find(:all, :conditions => {:id => post_map.keys.uniq, :trip_id => trip.id}, :order => "start ASC, finish ASC")
---
SELECT * FROM `locations` WHERE (`locations`.post_id = 109)
INSERT INTO `locations` (`post_id`, `lng`, `lat`) VALUES(NULL, -58.3731613, -34.6084175)
INSERT INTO `posts` (`finish`, `updated_at`, `title`, `start`, `content`, `remote_ref`, `photo_id`, `place_string`, `trip_id`, `remote_source_id`, `created_at`) VALUES('2009-10-18 01:28:26', '2009-10-20 01:28:27', 'My Post', '2009-10-17 01:28:26', 'Lorem Ipsum', NULL, NULL, '318 S 42nd St, 19104', 47, NULL, '2009-10-20 01:28:27')
DELETE FROM `locations` WHERE `id` = 240
SELECT `posts`.id FROM `posts` WHERE (trip_id = 1 and place_string IS NOT NULL and photo_id IS NULL) LIMIT 1